; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob49) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate9)
	(at pallet1 distributor0)
	(clear crate12)
	(at pallet2 distributor1)
	(clear crate6)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 486)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 400)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 19)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 20)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 95)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 9)
	(at crate4 distributor0)
	(on crate4 crate1)
	(= (weight crate4) 100)
	(at crate5 distributor1)
	(on crate5 crate3)
	(= (weight crate5) 15)
	(at crate6 distributor1)
	(on crate6 crate5)
	(= (weight crate6) 70)
	(at crate7 depot0)
	(on crate7 pallet0)
	(= (weight crate7) 67)
	(at crate8 distributor0)
	(on crate8 crate4)
	(= (weight crate8) 43)
	(at crate9 depot0)
	(on crate9 crate7)
	(= (weight crate9) 3)
	(at crate10 distributor0)
	(on crate10 crate8)
	(= (weight crate10) 59)
	(at crate11 distributor0)
	(on crate11 crate10)
	(= (weight crate11) 4)
	(at crate12 distributor0)
	(on crate12 crate11)
	(= (weight crate12) 48)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate9)
		(on crate1 crate5)
		(on crate2 crate7)
		(on crate4 crate11)
		(on crate5 crate0)
		(on crate6 crate10)
		(on crate7 crate12)
		(on crate8 pallet1)
		(on crate9 crate8)
		(on crate10 pallet2)
		(on crate11 crate6)
		(on crate12 pallet0)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist2 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist2) (on crate6 crate5)
   added: (lifting hoist2 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 12
2. (lift hoist1 crate12 crate11 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist1) (on crate12 crate11)
   added: (lifting hoist1 crate12) (clear crate11)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 12
3. (lift hoist0 crate9 crate7 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate7)
   added: (lifting hoist0 crate9) (clear crate7)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 12
4. (load hoist1 crate12 truck1 distributor0)
   deleted: (lifting hoist1 crate12)
   added: (in crate12 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 48
   goals met: 0 of 12
5. (lift hoist1 crate11 crate10 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist1) (on crate11 crate10)
   added: (lifting hoist1 crate11) (clear crate10)
   changed: (fuel-cost) from 3 to 4
   goals met: 0 of 12
6. (load hoist1 crate11 truck1 distributor0)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck1) (available hoist1)
   changed: (current_load truck1) from 48 to 52
   goals met: 0 of 12
7. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 4 to 14
   goals met: 0 of 12
8. (load hoist0 crate9 truck0 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 3
   goals met: 0 of 12
9. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 14 to 24
   goals met: 0 of 12
10. (lift hoist0 crate7 pallet0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 pallet0)
   added: (lifting hoist0 crate7) (clear pallet0)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 12
11. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 25 to 35
   goals met: 0 of 12
12. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 52 to 119
   goals met: 0 of 12
13. (lift hoist1 crate10 crate8 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate8)
   added: (lifting hoist1 crate10) (clear crate8)
   changed: (fuel-cost) from 35 to 36
   goals met: 0 of 12
14. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 36 to 46
   goals met: 0 of 12
15. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 46 to 56
   goals met: 0 of 12
16. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 3 to 73
   goals met: 0 of 12
17. (lift hoist2 crate5 crate3 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate3)
   added: (lifting hoist2 crate5) (clear crate3)
   changed: (fuel-cost) from 56 to 57
   goals met: 0 of 12
18. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 57 to 67
   goals met: 0 of 12
19. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   changed: (current_load truck1) from 119 to 134
   goals met: 0 of 12
20. (load hoist1 crate10 truck0 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck0) (available hoist1)
   changed: (current_load truck0) from 73 to 132
   goals met: 0 of 12
21. (lift hoist1 crate8 crate4 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist1) (on crate8 crate4)
   added: (lifting hoist1 crate8) (clear crate4)
   changed: (fuel-cost) from 67 to 68
   goals met: 0 of 12
22. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 68 to 78
   goals met: 0 of 12
23. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   changed: (current_load truck1) from 134 to 177
   goals met: 0 of 12
24. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 132 to 129
   goals met: 0 of 12
25. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 177 to 180
   goals met: 0 of 12
26. (lift hoist1 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist1) (on crate4 crate1)
   added: (lifting hoist1 crate4) (clear crate1)
   changed: (fuel-cost) from 78 to 79
   goals met: 0 of 12
27. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 180 to 280
   goals met: 0 of 12
28. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 79 to 80
   goals met: 0 of 12
29. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 129 to 149
   goals met: 0 of 12
30. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 80 to 81
   goals met: 0 of 12
31. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 280 to 299
   goals met: 0 of 12
32. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 149 to 79
   goals met: 0 of 12
33. (lift hoist2 crate3 crate2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   changed: (fuel-cost) from 81 to 82
   goals met: 0 of 12
34. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 82 to 92
   goals met: 0 of 12
35. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 79 to 149
   goals met: 0 of 12
36. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 92 to 102
   goals met: 0 of 12
37. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 299 to 308
   goals met: 0 of 12
38. (lift hoist2 crate2 pallet2 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 pallet2)
   added: (lifting hoist2 crate2) (clear pallet2)
   changed: (fuel-cost) from 102 to 103
   goals met: 0 of 12
39. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 149 to 244
   goals met: 0 of 12
40. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 308 to 289
   goals met: 0 of 12
41. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 244 to 263
   goals met: 0 of 12
42. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 289 to 246
   goals met: 0 of 12
43. (load hoist2 crate8 truck0 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck0) (available hoist2)
   changed: (current_load truck0) from 263 to 306
   goals met: 0 of 12
44. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 246 to 237
   goals met: 0 of 12
45. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 306 to 315
   goals met: 0 of 12
46. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 315 to 245
   goals met: 0 of 12
47. (load hoist2 crate6 truck1 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   changed: (current_load truck1) from 237 to 307
   goals met: 0 of 12
48. (unload hoist2 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck1) from 307 to 304
   goals met: 0 of 12
49. (load hoist2 crate9 truck0 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck0) (available hoist2)
   changed: (current_load truck0) from 245 to 248
   goals met: 0 of 12
50. (unload hoist2 crate11 truck1 distributor1)
   deleted: (in crate11 truck1) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck1) from 304 to 300
   goals met: 0 of 12
51. (load hoist2 crate11 truck0 distributor1)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   changed: (current_load truck0) from 248 to 252
   goals met: 0 of 12
52. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 252 to 233
   goals met: 0 of 12
53. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   changed: (current_load truck1) from 300 to 319
   goals met: 0 of 12
54. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck1) from 319 to 249
   goals met: 0 of 12
55. (load hoist2 crate6 truck0 distributor1)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck0) (available hoist2)
   changed: (current_load truck0) from 233 to 303
   goals met: 0 of 12
56. (unload hoist2 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   changed: (current_load truck0) from 303 to 244
   goals met: 0 of 12
57. (drop hoist2 crate10 pallet2 distributor1)
   deleted: (lifting hoist2 crate10) (clear pallet2)
   added: (available hoist2) (at crate10 distributor1) (clear crate10) (on crate10 pallet2)
   goals met: 1 of 12
58. (unload hoist2 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck1) from 249 to 149
   goals met: 1 of 12
59. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 244 to 344
   goals met: 1 of 12
60. (unload hoist2 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck1) from 149 to 82
   goals met: 1 of 12
61. (load hoist2 crate7 truck0 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 344 to 411
   goals met: 1 of 12
62. (unload hoist2 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   changed: (current_load truck0) from 411 to 408
   goals met: 1 of 12
63. (load hoist2 crate9 truck1 distributor1)
   deleted: (lifting hoist2 crate9)
   added: (in crate9 truck1) (available hoist2)
   changed: (current_load truck1) from 82 to 85
   goals met: 1 of 12
64. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 85 to 66
   goals met: 1 of 12
65. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 408 to 427
   goals met: 1 of 12
66. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 427 to 384
   goals met: 1 of 12
67. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 66 to 109
   goals met: 1 of 12
68. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 384 to 364
   goals met: 1 of 12
69. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 109 to 129
   goals met: 1 of 12
70. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 364 to 345
   goals met: 1 of 12
71. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   changed: (current_load truck1) from 129 to 148
   goals met: 1 of 12
72. (unload hoist2 crate12 truck1 distributor1)
   deleted: (in crate12 truck1) (available hoist2)
   added: (lifting hoist2 crate12)
   changed: (current_load truck1) from 148 to 100
   goals met: 1 of 12
73. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 103 to 113
   goals met: 1 of 12
74. (load hoist2 crate12 truck0 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   changed: (current_load truck0) from 345 to 393
   goals met: 1 of 12
75. (unload hoist2 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 393 to 323
   goals met: 1 of 12
76. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck1) from 100 to 57
   goals met: 1 of 12
77. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 113 to 123
   goals met: 1 of 12
78. (unload hoist0 crate12 truck0 depot0)
   deleted: (in crate12 truck0) (available hoist0)
   added: (lifting hoist0 crate12)
   changed: (current_load truck0) from 323 to 275
   goals met: 1 of 12
79. (load hoist1 crate8 truck1 distributor0)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck1) (available hoist1)
   changed: (current_load truck1) from 57 to 100
   goals met: 1 of 12
80. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 123 to 133
   goals met: 1 of 12
81. (unload hoist1 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 100 to 97
   goals met: 1 of 12
82. (drop hoist2 crate6 crate10 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate10)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate10)
   goals met: 2 of 12
83. (unload hoist2 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist2)
   added: (lifting hoist2 crate11)
   changed: (current_load truck0) from 275 to 271
   goals met: 2 of 12
84. (drop hoist2 crate11 crate6 distributor1)
   deleted: (lifting hoist2 crate11) (clear crate6)
   added: (available hoist2) (at crate11 distributor1) (clear crate11) (on crate11 crate6)
   goals met: 3 of 12
85. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 271 to 171
   goals met: 3 of 12
86. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 133 to 143
   goals met: 3 of 12
87. (drop hoist0 crate12 pallet0 depot0)
   deleted: (lifting hoist0 crate12) (clear pallet0)
   added: (available hoist0) (at crate12 depot0) (clear crate12) (on crate12 pallet0)
   goals met: 4 of 12
88. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 171 to 104
   goals met: 4 of 12
89. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   changed: (current_load truck1) from 97 to 100
   goals met: 4 of 12
90. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck1) from 100 to 57
   goals met: 4 of 12
91. (drop hoist1 crate8 pallet1 distributor0)
   deleted: (lifting hoist1 crate8) (clear pallet1)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 pallet1)
   goals met: 5 of 12
92. (unload hoist1 crate9 truck1 distributor0)
   deleted: (in crate9 truck1) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck1) from 57 to 54
   goals met: 5 of 12
93. (drop hoist1 crate9 crate8 distributor0)
   deleted: (lifting hoist1 crate9) (clear crate8)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 crate8)
   goals met: 6 of 12
94. (drop hoist0 crate7 crate12 depot0)
   deleted: (lifting hoist0 crate7) (clear crate12)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate12)
   goals met: 7 of 12
95. (unload hoist1 crate0 truck1 distributor0)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 54 to 35
   goals met: 7 of 12
96. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 104 to 9
   goals met: 7 of 12
97. (drop hoist1 crate0 crate9 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate9)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate9)
   goals met: 8 of 12
98. (drop hoist0 crate2 crate7 depot0)
   deleted: (lifting hoist0 crate2) (clear crate7)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate7)
   goals met: 9 of 12
99. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 35 to 20
   goals met: 9 of 12
100. (drop hoist1 crate5 crate0 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate0)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate0)
   goals met: 10 of 12
101. (drop hoist2 crate4 crate11 distributor1)
   deleted: (lifting hoist2 crate4) (clear crate11)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 crate11)
   goals met: 11 of 12
102. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   changed: (current_load truck1) from 20 to 0
   goals met: 11 of 12
103. (drop hoist1 crate1 crate5 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate5)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate5)
   goals met: 12 of 12
